Config/Documents/УниверсальныйРегламентированныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УниверсальныйРегламентированныйОтчет</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Периоды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньТочности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийРедактировавший</Name>
					<Comment>Пользователь, внесший последние изменения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редакция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РедакцииОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БланкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеАналитики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПечатныйБланк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизвольныеБланкиФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатЗаполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/ГруппыРаскрытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГруппыРаскрытия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазрешитьСовпаденияИзмерений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Аналитика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАналитики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ПоказателиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПоказателиОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидИтога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИтоговПоказателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРаскрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыРаскрытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтрокиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КолонкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФинансовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеМасштабируется</Name>
					<Comment>Точность отображения показателя не зависит от точности отображения документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеограниченнаяДлина</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПромежуточныеИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньТочностиПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальнаяТочность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/УниверсальныйРегламентированныйОтчет/Forms/НастройкаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ТекущиеНастройки) = Тип("Структура") Тогда
		КонтекстОтчета 		= ПолучитьИзВременногоХранилища(Параметры.ТекущиеНастройки.АдресОтчета);
		СтрТекущихНастроек 	= КонтекстОтчета.ТабОбластиРаскрытия.Найти(Параметры.ТекущиеНастройки.КодСтроки,"КодСтроки");
		Если СтрТекущихНастроек = Неопределено Тогда
			Отказ = Истина;
		КонецЕсли;
		
		ГруппаРаскрытия = СтрТекущихНастроек.ГруппаРаскрытия;
		
	Иначе
		СтрТекущихНастроек = ПолучитьИзВременногоХранилища(Параметры.ТекущиеНастройки);
		ГруппаРаскрытия	   = Параметры.ГруппаРаскрытия;
	КонецЕсли;
	
	// Заполнение доступных полей.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОтчета"		,Параметры.ВидОтчета);
	Запрос.УстановитьПараметр("ГруппаРаскрытия"	,ГруппаРаскрытия);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыРаскрытияАналитика.НомерСтроки КАК ИмяПоля,
	|	ГруппыРаскрытияАналитика.ВидАналитики.Наименование КАК Наименование,
	|	ГруппыРаскрытияАналитика.ВидАналитики.ТипЗначения КАК ТипЗначения,
	|	ГруппыРаскрытияАналитика.ВидАналитики КАК ВидАналитики,
	|	""Аналитика"" КАК ВидПоля,
	|	ГруппыРаскрытияАналитика.НомерСтроки КАК ПорядковыйНомер,
	|	1 КАК НомерЗапроса
	|ИЗ
	|	Справочник.ГруппыРаскрытия.Аналитика КАК ГруппыРаскрытияАналитика
	|ГДЕ
	|	ГруппыРаскрытияАналитика.Ссылка.Владелец = &ВидОтчета
	|	И ГруппыРаскрытияАналитика.Ссылка = &ГруппаРаскрытия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоказателиОтчетов.Код,
	|	ПоказателиОтчетов.Колонка.Наименование,
	|	ПоказателиОтчетов.ТипЗначения,
	|	NULL,
	|	""Показатель"",
	|	ПоказателиОтчетов.Колонка.ПорядковыйНомер,
	|	2
	|ИЗ
	|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|ГДЕ
	|	ПоказателиОтчетов.Владелец = &ВидОтчета
	|	И ПоказателиОтчетов.ГруппаРаскрытия = &ГруппаРаскрытия
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗапроса,
	|	ПорядковыйНомер";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = РезультатЗапроса.Выбрать();
	
	ОбъектМетаданныхКонфигурация = Метаданные;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидПоля = "Аналитика" Тогда
			
			СтрПоле 					= ВсеПоля.Добавить();
			СтрПоле.ИмяПоля 			= "Аналитика" + Выборка.ИмяПоля;
			СтрПоле.ПредставлениеПоля 	= Выборка.Наименование;
			СтрПоле.ТипДанных		    = Выборка.ТипЗначения;
			СтрПоле.ВидАналитики		= Выборка.ВидАналитики;
			
			ТипЗначенияАналитики = Выборка.ТипЗначения.Типы()[0];
			
			
			// Поле отбора.
			СтрПолеОтбора = ДоступныеПоляОтбора.Добавить();
			ЗаполнитьЗначенияСвойств(СтрПолеОтбора,СтрПоле);
			
			// Поле сортировки.
			СтрПолеСортировки = ДоступныеПоляСортировки.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрПолеСортировки,СтрПоле);
			
			Если ТипЗначенияАналитики <> Тип("Строка") 
				И Не Перечисления.ТипВсеСсылки().СодержитТип(ТипЗначенияАналитики) Тогда
				
				МетаданныеТипа 		 = ОбъектМетаданныхКонфигурация.НайтиПоТипу(ТипЗначенияАналитики);
				Если МетаданныеТипа.ДлинаНаименования > 0 Тогда
					ПолеРеквизита					= ВсеПоля.Добавить();
					ПолеРеквизита.ИмяПоля 			= СтрПоле.ИмяПоля + ".Наименование";
					ПолеРеквизита.ПредставлениеПоля = МетаданныеТипа.СтандартныеРеквизиты.Наименование.Представление();
					ПолеРеквизита.ТипДанных		    = БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(МетаданныеТипа.ДлинаНаименования);
					
					СтрВложенноеПоле = СтрПолеСортировки.ПолучитьЭлементы().Добавить();
					ЗаполнитьЗначенияСвойств(СтрВложенноеПоле,ПолеРеквизита);
					
				КонецЕсли;
				
				Если МетаданныеТипа.ДлинаКода > 0 Тогда
					ПолеРеквизита					= ВсеПоля.Добавить();
					ПолеРеквизита.ИмяПоля 			= СтрПоле.ИмяПоля + ".Код";
					ПолеРеквизита.ПредставлениеПоля = МетаданныеТипа.СтандартныеРеквизиты.Код.Представление();
					ПолеРеквизита.ТипДанных		    = БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(МетаданныеТипа.ДлинаКода);
					
					СтрВложенноеПоле = СтрПолеСортировки.ПолучитьЭлементы().Добавить();
					ЗаполнитьЗначенияСвойств(СтрВложенноеПоле,ПолеРеквизита);
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			СтрПоле 					= ВсеПоля.Добавить();
			СтрПоле.ИмяПоля 			= Выборка.ИмяПоля;
			СтрПоле.ПредставлениеПоля 	= Выборка.Наименование;
			СтрПоле.ТипДанных		    = БюджетнаяОтчетность.ПолучитьОписаниеТиповДляЗначенияПоказателя(Выборка.ТипЗначения);
			
			// Поле отбора.
			СтрПолеОтбора = ДоступныеПоляОтбора.Добавить();
			ЗаполнитьЗначенияСвойств(СтрПолеОтбора,СтрПоле);
			
			// Поле сортировки.
			СтрПолеСортировки = ДоступныеПоляСортировки.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрПолеСортировки,СтрПоле);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполнение данных формы.
	ЗаполнитьФорму(СтрТекущихНастроек);

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеЭлементами()
КонецПроцедуры




&НаСервере
Процедура ЗаполнитьФорму(ТекущиеНастройки)

	Если ВсеПоля.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПоляСортировкиДерево = РеквизитФормыВЗначение("ДоступныеПоляСортировки");
	ПоляОтбораТаблица	 = РеквизитФормыВЗначение("ДоступныеПоляОтбора");

	// Заполнение текущих настроек.
	Если Не ТекущиеНастройки.ПоляСортировки = Неопределено Тогда
		// Заполнение настроек сортировки
		Для Каждого ЭлементНастройки Из ТекущиеНастройки.ПоляСортировки Цикл
			
			ОписаниеПоля = ПоляСортировкиДерево.Строки.Найти(ЭлементНастройки.ИмяПоля,"ИмяПоля",Истина);
			
			Если Не ОписаниеПоля = Неопределено Тогда
				СтрСортировка = ВыбранныеПоляСортировки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрСортировка,ЭлементНастройки);
				
				ПредставлениеПоля = "";
				Если ОписаниеПоля.Родитель <> Неопределено Тогда
					ПредставлениеПоля = ОписаниеПоля.Родитель.ПредставлениеПоля + ".";
				КонецЕсли;
				
				СтрСортировка.ПредставлениеПоля = ПредставлениеПоля+ОписаниеПоля.ПредставлениеПоля;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ТекущиеНастройки.ОтборПоРаскрытию = Неопределено Тогда
		// Заполнение текущего отбора
		Для Каждого ЭлементОтбора Из ТекущиеНастройки.ОтборПоРаскрытию Цикл
			
			ОписаниеПоля = ПоляОтбораТаблица.Найти(ЭлементОтбора.Ключ,"ИмяПоля");
			
			Если Не ОписаниеПоля = Неопределено Тогда
				
				СтрОтбора = ВыбранныеПоляОтбора.Добавить();
				СтрОтбора.ИмяПоля = ЭлементОтбора.Ключ;
				СтрОтбора.ПредставлениеПоля = ОписаниеПоля.ПредставлениеПоля;
				СтрОтбора.ВидСравнения  = ЭлементОтбора.Значение.ВидСравнения;
				СтрОтбора.Значение 	    = ЭлементОтбора.Значение.Значение;
				//СтрОтбора.Использование = Истина;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	РучнаяСортировка = ТекущиеНастройки.РучнаяСортировка;
	
КонецПроцедуры // ЗаполнитьФорму()

&НаСервере
Процедура ЗагрузитьДеревоЗначений(Приемник, Источник, СписокСвойств = "")

	КоллекцияИсточник = Источник.Строки;
	КоллекцияПриемник = Приемник.Строки;
	
	Для Каждого СтрИсточник Из КоллекцияИсточник Цикл
		
		СтрПриемник = КоллекцияПриемник.Добавить();
		
		Если ПустаяСтрока(СписокСвойств) Тогда
			ЗаполнитьЗначенияСвойств(СтрПриемник,СтрИсточник);
		Иначе
			ЗаполнитьЗначенияСвойств(СтрПриемник,СтрИсточник,СписокСвойств);
		КонецЕсли;
		
		ЗагрузитьДеревоЗначений(СтрПриемник,СтрИсточник);
		
	КонецЦикла;
		
КонецПроцедуры // ЗагрузитьДеревоЗначений()

&НаСервере
Функция СохранитьРезультатНастройки()

	ТаблицаОтбора 		= РеквизитФормыВЗначение("ВыбранныеПоляОтбора");
	ТаблицаСортировки   = РеквизитФормыВЗначение("ВыбранныеПоляСортировки");
	
	НастройкаСписка = Новый Структура;
	
	НастройкаСписка.Вставить("Отбор"	 ,ТаблицаОтбора.Скопировать(,"ИмяПоля,ВидСравнения,Значение"));
	НастройкаСписка.Вставить("Сортировка",ТаблицаСортировки.Скопировать(,"ИмяПоля,НаправлениеСортировки"));
	НастройкаСписка.Вставить("РучнаяСортировка",РучнаяСортировка);
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(НастройкаСписка);
	
	Возврат АдресВременногоХранилища;

КонецФункции // СохранитьРезультатНастройки()


&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(СохранитьРезультатНастройки());
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

&НаКлиенте
Процедура ДобавитьВыбранноеПоле(ВыбранноеПоле, Приемник)

	Если Приемник.НайтиСтроки(Новый Структура("ИмяПоля",ВыбранноеПоле.ИмяПоля)).Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Если Приемник = ВыбранныеПоляСортировки и ВыбранноеПоле.ПолучитьРодителя() <> Неопределено Тогда
		ПредставлениеПоля = ВыбранноеПоле.ПолучитьРодителя().ПредставлениеПоля + "." + ВыбранноеПоле.ПредставлениеПоля;
	Иначе
		ПредставлениеПоля = ВыбранноеПоле.ПредставлениеПоля;
	КонецЕсли;
	
	НоваяСтрока = Приемник.Добавить();
	НоваяСтрока.ИмяПоля 			= ВыбранноеПоле.ИмяПоля;
	НоваяСтрока.ПредставлениеПоля 	= ПредставлениеПоля;

КонецПроцедуры // ДобавитьВыбранноеПоле()

&НаКлиенте
Процедура УстановитьТипЗначенияОтбора(ТекущиеДанные)

	ЭлементУправления 	= Элементы.ВыбранныеПоляОтбораЗначение;
	НайденныеПоля		= ВсеПоля.НайтиСтроки(Новый Структура("ИмяПоля",ТекущиеДанные.ИмяПоля));
	Если НайденныеПоля.Количество() = 0 Тогда
		ЭлементУправления.Доступность = Ложь;
		ТекущиеДанные.Значение 		  = Неопределено;
		Возврат;
	Иначе
		ЭлементУправления.Доступность = Истина;
	КонецЕсли;
	
	ОписаниеПоля 	= НайденныеПоля[0];
	ОграничениеТипа = ОписаниеПоля.ТипДанных;
	
	Если ТекущиеДанные.ВидСравнения = ВидСравнения.ВСписке
		 или ТекущиеДанные.ВидСравнения = ВидСравнения.ВСпискеПоИерархии
		 или ТекущиеДанные.ВидСравнения = ВидСравнения.НеВСписке
		 или ТекущиеДанные.ВидСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
		 
		ЭлементУправления.ОграничениеТипа = Новый ОписаниеТипов("СписокЗначений");		
		
	Иначе
		
		ЭлементУправления.ОграничениеТипа = ОграничениеТипа;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеПоля.ВидАналитики) Тогда
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Владелец",ОписаниеПоля.ВидАналитики));
		ЭлементУправления.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	КонецЕсли;
	
	ТекущиеДанные.Значение = ЭлементУправления.ОграничениеТипа.ПривестиЗначение(ТекущиеДанные.Значение);
	Если ТипЗнч(ТекущиеДанные.Значение) = Тип("СписокЗначений") Тогда
		ТекущиеДанные.Значение.ТипЗначения = ОграничениеТипа;
	КонецЕсли;
	
	
КонецПроцедуры // УстановитьТипЗначенияОтбора()	 

&НаКлиенте
Процедура УправлениеЭлементами()
	
	Элементы.ВыбранныеПоляСортировкиРучнаяСортировка.Пометка = РучнаяСортировка; 
	
	Элементы.ДоступныеПоляСортировки.Доступность = Не РучнаяСортировка;
	Элементы.ВыбранныеПоляСортировки.Доступность = Не РучнаяСортировка;
	Элементы.ВыбранныеПоляСортировкиГруппаСтандартныеКнопки.Доступность = Не РучнаяСортировка;
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаПроизвольногоОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Источник = "ВыбранныеПоляОтбораПредставлениеПоляНачалоВыбора" Тогда 
		Если Результат = Неопределено Тогда 
			Возврат;
		КонецЕсли;	
		Стр = ДополнительныеПараметры.ДоступныеПоляОтбора.НайтиСтроки(Новый Структура("ИмяПоля",Результат.Значение))[0];
		ДополнительныеПараметры.ТекущиеДанные.ИмяПоля = Стр.ИмяПоля;
		ДополнительныеПараметры.ТекущиеДанные.ПредставлениеПоля = Стр.ПредставлениеПоля;	
		
	КонецЕсли;	
	
КонецПроцедуры	

/////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ
//

&НаКлиенте
Процедура ДоступныеПоляОтбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДобавитьВыбранноеПоле(ДоступныеПоляОтбора.НайтиПоИдентификатору(ВыбраннаяСтрока),ВыбранныеПоляОтбора);
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляОтбораНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	ПараметрыПеретаскивания.Действие 			= ДействиеПеретаскивания.Копирование;
	ПараметрыПеретаскивания.ДопустимыеДействия  = ДопустимыеДействияПеретаскивания.Копирование;
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляСортировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДобавитьВыбранноеПоле(ДоступныеПоляСортировки.НайтиПоИдентификатору(ВыбраннаяСтрока),ВыбранныеПоляСортировки);
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляСортировкиНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	ПараметрыПеретаскивания.Действие 			= ДействиеПеретаскивания.Копирование;
	ПараметрыПеретаскивания.ДопустимыеДействия  = ДопустимыеДействияПеретаскивания.Копирование;
КонецПроцедуры


// Управление выбранными полями отбора.

&НаКлиенте
Процедура ВыбранныеПоляОтбораПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	Для Каждого Стр Из ПараметрыПеретаскивания.Значение Цикл
		ДобавитьВыбранноеПоле(Стр,ВыбранныеПоляОтбора);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляОтбораПредставлениеПоляНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокВыбора 		 = Новый СписокЗначений;
	ТекущиеДанные 		 = Элементы.ВыбранныеПоляОтбора.ТекущиеДанные;
	ВыбранноеЗначение	 = Неопределено;
	
	Для Каждого Стр Из ДоступныеПоляОтбора Цикл
		Элемент = СписокВыбора.Добавить(Стр.ИмяПоля,Стр.ПредставлениеПоля,,БиблиотекаКартинок.ДоступноеПолеГруппировки);
		Если Стр = ТекущиеДанные Тогда
			ВыбранноеЗначение = Элемент;
		КонецЕсли;
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник","ВыбранныеПоляОтбораПредставлениеПоляНачалоВыбора");
	ДополнительныеПараметры.Вставить("ДоступныеПоляОтбора",ДоступныеПоляОтбора);
	ДополнительныеПараметры.Вставить("ТекущиеДанные",ТекущиеДанные);

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПроизвольногоОповещения", ЭтаФорма, ДополнительныеПараметры);

	СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru = 'Выберите поле.'"), ВыбранноеЗначение);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляОтбораПредставлениеПоляАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДлинаТекста  = СтрДлина(Текст);
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Каждого СтрДоступных Из ДоступныеПоляОтбора Цикл
		Если ВРЕГ(Лев(СтрДоступных.ПредставлениеПоля,ДлинаТекста)) = ВРЕГ(Текст) Тогда
			ДанныеВыбора.Добавить(СтрДоступных.ИмяПоля,СтрДоступных.ПредставлениеПоля);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляОтбораПредставлениеПоляОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДлинаТекста  = СтрДлина(Текст);
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Каждого СтрДоступных Из ДоступныеПоляОтбора Цикл
		Если ВРЕГ(Лев(СтрДоступных.ПредставлениеПоля,ДлинаТекста)) = ВРЕГ(Текст) Тогда
			ДанныеВыбора.Добавить(СтрДоступных.ИмяПоля,СтрДоступных.ПредставлениеПоля);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляОтбораПредставлениеПоляОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные 		 = Элементы.ВыбранныеПоляОтбора.ТекущиеДанные;
	
	Стр 							= ДоступныеПоляОтбора.НайтиСтроки(Новый Структура("ИмяПоля",ВыбранноеЗначение))[0];
	ТекущиеДанные.ИмяПоля 			= Стр.ИмяПоля;
	ТекущиеДанные.ПредставлениеПоля = Стр.ПредставлениеПоля;
	
	УстановитьТипЗначенияОтбора(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляОтбораПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Не (НоваяСтрока и ОтменаРедактирования) и Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.ИмяПоля) Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,НСтр("ru = 'Не указано имя поля!'"));
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляОтбораПредставлениеПоляОчистка(Элемент, СтандартнаяОбработка)
	ТекДанные 		  = Элементы.ВыбранныеПоляОтбора.ТекущиеДанные;
	ТекДанные.ИмяПоля = "";
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляОтбораПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	 УстановитьТипЗначенияОтбора(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляОтбораВидСравненияПриИзменении(Элемент)
	УстановитьТипЗначенияОтбора(Элементы.ВыбранныеПоляОтбора.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляОтбораВидСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные 	  = Элементы.ВыбранныеПоляОтбора.ТекущиеДанные;
	НайденныеПоля = ВсеПоля.НайтиСтроки(Новый Структура("ИмяПоля",ТекДанные.ИмяПоля));
	
	Если НайденныеПоля.Количество() = 0 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	ОписаниеПоля = НайденныеПоля[0];
	
	ДоступныеВидыСравнения = Новый СписокЗначений;
	ДоступныеВидыСравнения.Добавить(ВидСравнения.Равно);
	ДоступныеВидыСравнения.Добавить(ВидСравнения.ВСписке);
	ДоступныеВидыСравнения.Добавить(ВидСравнения.НеРавно);
	ДоступныеВидыСравнения.Добавить(ВидСравнения.НеВСписке);
	
	Если ОписаниеПоля.ТипДанных.СодержитТип(Тип("Строка")) Тогда
		ДоступныеВидыСравнения.Добавить(ВидСравнения.Содержит);
		ДоступныеВидыСравнения.Добавить(ВидСравнения.НеСодержит);
	ИначеЕсли ОписаниеПоля.ТипДанных.СодержитТип(Тип("Число")) или ОписаниеПоля.ТипДанных.СодержитТип(Тип("Дата")) Тогда
		ДоступныеВидыСравнения.Добавить(ВидСравнения.Больше);
		ДоступныеВидыСравнения.Добавить(ВидСравнения.БольшеИлиРавно);
		ДоступныеВидыСравнения.Добавить(ВидСравнения.Меньше);
		ДоступныеВидыСравнения.Добавить(ВидСравнения.МеньшеИлиРавно);
	ИначеЕсли ЗначениеЗаполнено(ОписаниеПоля.ВидАналитики) Тогда
		ДоступныеВидыСравнения.Добавить(ВидСравнения.ВИерархии);
		ДоступныеВидыСравнения.Добавить(ВидСравнения.ВСпискеПоИерархии);
		ДоступныеВидыСравнения.Добавить(ВидСравнения.НеВИерархии);
		ДоступныеВидыСравнения.Добавить(ВидСравнения.НеВСпискеПоИерархии);
	КонецЕсли;
	
	ДанныеВыбора = ДоступныеВидыСравнения;
	
КонецПроцедуры


// Управление полями сортировки.

&НаКлиенте
Процедура ВыбранныеПоляСортировкиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	Для Каждого Стр Из ПараметрыПеретаскивания.Значение Цикл
		ДобавитьВыбранноеПоле(Стр,ВыбранныеПоляОтбора);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляСортировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РучнаяСортировка(Команда)
	РучнаяСортировка = Не РучнаяСортировка;
	
	УправлениеЭлементами();
	
КонецПроцедуры
